// 트리 -이진트리

// 트리 - 나무의 형태를 뒤집은것과 같은 형태의 자료구조

// 루트 노드 : 트리의 최상단 노드
// 리프 노드 : 트리의 최하단 노드
// 각각의 노드는 부모 노드와 자식노드를 가지며 부모노드가 같은 노드를 형제 노드라고한다
// 길이 : 출발 노드에서 목적지 노드까지 거쳐야 하는 가짓수를 의미한다.
// 깊이 : 루트 노드에서 특정 노드까지의 길이를 의미한다. 
// 높이 : 루트노드에서 가장 깊은 노드까지의 길이


// 이진 트리(Binary Tree) 최대 2개의 자식을 가질 수 있는 트리
// 포화 이진 트리 (Full Binary Tree)는 리프노드를 제외하고 '모든 노드'가 '두개의 자식을 가지고 있는' 트리
// 완전 이진 트리 (Completely Binary Tree)  모든 노드들이 왼쪽 자식부터 차근차근 채워진 노드
// 높이 균형 트릐 (Height Balanced Tree) 왼쪽 자식 트리와 오른쪽 자식 트리의 높이가 '1 이상 차이가 나지않는' 트리


// 이진트리는 많은 양의 노드를 낮은 높이에서 관리할 수 있다는 점에서 데이터 활용의 효율성이 높아진다.
// 데이터 저장, 탐색등 다양한 목적에서 사용할 수 있다.
